OdIfcFile.collectEntityIds
\details
Updates collection of IFC GUID entitiy identifiers.
\returns Returns eOk if the update was successfull; otherwise, the method returns an appropriate error code.

OdIfcFile.checkSchema(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Checks if schema with identifier provided is supported by OdIfcFile.
\param schemaIdentifier [in] A string that contains the schema identifier.
\returns true if schema is supported by OdIfcFile instance; otherwise returns false.
\remarks Schema identifier may be empty, or must contain IFC letters.

OdIfcFile.onReadFileEnd
\details
Method is called just after file reading has ended, it initializes units converter for loaded model.
\returns eOk if operation successfully done; otherwise, the method returns an appropriate error code.

OdIfcFile.getPresentationLayers
\details
Retrieves all found IfcPresentationLayerAssignment and its subclasses instances object identifiers within a model.
\returns An OdArray of identifiers of the layers instances of the model.

OdIfcFile.gsNode
\details
Retrieves the current Gs node object of the entity.
\returns Returns a raw pointer to the OdGsCache object associated with the entity.

OdIfcFile.setGsNode(OdGsCache*)
\details
Sets a new Gs node cache for the drawable.
\param pGsNode [in] A raw pointer to an OdGsCache object.

OdIfcFile.fireObjectModified(OdIfc.OdIfcCompound*)
\details
Performs notifications whenever an OdIfcCompound inner entity has been modified in the current OdIfcFile.
\param pProduct [in]  Pointer to the object being modified.

OdIfcFile.fireObjectAppended(OdIfc.OdIfcCompound*)
\details
Performs notifications whenever an OdIfcCompound inner entity has been appended to an OdIfcFile.
\param pProduct [in]  Pointer to the object being appended.

OdIfcFile.fireObjectErased(OdIfc.OdIfcCompound*,System.Boolean)
\details
Performs notifications whenever an OdIfcCompound inner entity has been erased in the current OdIfcFile.
\param pProduct [in]  Pointer to the object being erased.

OdIfcFile.addReactor(OdIfcDatabaseReactor*)
\details
Function adds reactor instanse to the OdIfcFile.
\param pReactor [in]  Pointer to the notification class.

OdIfcFile.updateProduct(OdDAI.ApplicationInstance*)
\details
Updates state of modified IfcProduct with unresolve/resolve attempt and allows reactor mechanism send appropiate notifications.
\param pProduct [in]  Pointer to the instance that has been modified (including geometric representation and others).
\returns true if the operation was successful; otherwise the method returns false.

OdIfcFile.registerProduct(OdDAI.ApplicationInstance*)
\details
Updates state of newly added to the model IfcProduct and allows reactor mechanism send appropiate notifications.
\param pProduct [in]  Pointer to the instance that has been appended to the file content.
\returns true if the operation was successful; otherwise the method returns false.
\remarks
It is recommended registered product to be completely created within IFC Model, including geometric representation and other relationships, before registering.

OdIfcFile.getGeomExtents(OdGeExtents3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the current geometrical extents of the model.
\param extents [out] A placeholder for the current geometry extents object to be returned to a calling subroutine.
\returns eOk if the current extents were successfully returned; otherwise, the method returns an appropriate error code.
\remarks
The method returns the model extents only if the model was created by calling the setGeomResource() method.
The method accepts an instance of the OdGeExtents3d class, fills it with the data about the model's extents and
returns it to a calling subroutine.

OdIfcFile.getContextSelected(OdDAIObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Determines whether an instance of the IfcGeometricRepresentationContext class is selected to build the geometry.
\param idCtx [in] Object ID of geometric context to test.
\returns true if an IfcGeometricRepresentationContext object is selected; otherwise, the method returns false.

OdIfcFile.unresolveEntities
\details
Unresolve entities in the IFC model.
\returns eOk if the unresolve was successful; otherwise, the method returns an appropriate error code.

OdIfcFile.getActiveView
\details
Retrieves the current active view of the IFC file object.
\returns Returns a raw pointer to the OdGsView object that represents the currently active view.

OdIfcFile.setActiveView(OdGsView*)
\details
Sets a new active view for the IFC file's content.
\param pActiveView [in] A raw pointer to the OdGsView object.

OdIfcFile.getSpaces
\details
Returns all found IfcSpace instances object identifiers within a model.
\returns An OdArray of identifiers of the IfcSpace instances of the model.
\remarks
Collection could be empty.

OdIfcFile.getRootIds
\details
Returns all found IfcProject instances object identifiers within a model.
\returns An OdArray of identifiers of the root instances of the model.
\remarks
Each valid IFC model must have exactly one root instance.

OdIfcFile.getProjectId
\details
Retrieves the IFC model's root entity.
\returns The identifier of the root entity of the model.
\remarks
Each valid IFC file must have exactly one root entity.

OdIfcFile.Dispose
\details
Destroys the IFC file object.

OdIfcFile.#ctor
\details
Creates a new IFC file object with default parameters.

OdIfcFile
\details
A class that implements working with an IFC file header and data sections (header and model),
takes responsibility for the geometry creation and visualization, higher-level features like the access to unit conversions and mapping IfcGuid - OdDAIObjectId.